const chapters = {
    0: [
        ['*林峰出生在一个工薪阶层的小康之家，随着信息技术的发展，没想到他将带领人类从生物到数据的升华*'],
        ['开始', 1]
    ],
    1: [
        ['林峰出生在一个工薪阶层的小康之家'],
        ['出生', 2],
        ['流产', 3]
    ],
    2: [
        ['出生了'],
        ['男孩', 4],
        ['女孩', 5]
    ],
    3: [
        ['流产了，故事结束'],
        ['从头开始', 0]
    ],
    4: [
        [
            "林大山看到自己媳妇生了个儿子，开心又失落，毕竟哪个父亲不想要个女儿呢？ 未来要给儿子买房买车娶媳妇，想想心里就难受\n\n他立刻抬起头，看到虚弱的妻子躺在床上，游离的眼神饱含泪水，无力地看着自己，大山立刻走上前去，用嘴唇轻轻亲吻了她的面颊\n\n\"辛苦了\"\n\n妻子尽力的微笑点点头，\"健康吗？\"\n\n作为一个母亲，最怕的就是宝宝的健康了吧..\n\n哈哈哈'sadf'1"
        ],
        ['我要写', 0]
    ],
    5: [
        ['女孩子就要美美哒，当什么程序员！！！嫁给程序员就好啦~'],
        ['我要写', 0
        ]
    ],
    //--CHAPTER_ADD_HERE--//
};