{
    "0": [
        [
            "*林峰出生在一个工薪阶层的小康之家，随着信息技术的发展，没想到他将带领人类从生物到数据的升华*"
        ],
        [
            "开始",
            1
        ]
    ],
    "1": [
        [
            "在产房里，外面的丈夫坐在椅子上，焦急的等待着。\n\n不是他不站起来，是因为担心与害怕席卷了全身，怕....\n\n在生产之前，他明确的说过：不管怎么样，都要保大人！！\n\n医生笑了笑，跟他说：“大哥，这都啥年代了，几乎没有生不出来的，实在有问题的话就剖腹产了，很安全”\n\n“好吧，不过万一真的有什么问题，一定要保大人”，林大山坚定的说\n\n“好的好的”，医生收回了笑容，因为这不是他不信任医生，而是更珍惜他的女人。"
        ],
        [
            "出生",
            "2"
        ],
        [
            "流产",
            "3"
        ]
    ],
    "2": [
        [
            "大山焦急的等待着，产房的红灯一直亮着。\n\n他大脑空白，仿佛没有了思想。\n\n在产房外踱步走来走去，心烦意乱，还是坐下比较放松一些。\n\n紧张的神经导致双腿就像爬过百望山一样，不自然的抽动着。\n\n”哇！哇！“，妇产室里传来婴儿的哭啼声\n\n”生了？！？“，虽然屋外每人，林大山不自主的大喊了起来，仿佛要告诉世界，我当爸爸了。\n\n“家属进来，母子平安昂”，一名小护士推开门对大山平静而不经心地说道，可能对于护士，生产已经司空见惯。但是对于一个家庭来说，这是头等大事。\n\n“好好”，林大山踉跄着快步跑了进去。\n\n看到婴儿裹着毯子抱在一个护士怀里，护士看到林大山后，把婴儿推给了他。但是大山没有接过来，径直走向手术床前，看到了自己虚弱的妻子。\n\n”怎么样？累不累？”大山温柔的问道\n\n”嗯...“，妻子虚弱的回复，点了点头，脸上漏出了一点点的笑容\n\n”我去看看孩子“，大山用嘴唇轻轻亲吻了她的面颊后说\n\n”男孩女孩？“ 大山问到。\n\n”自己看“ 护士笑呵呵的对他说。\n\n林大山接过婴儿，心想：”怎么这么难看？“\n\n掀开襁褓，分开小腿一看，他立刻抬起头，看到虚弱的妻子躺在床上，游离的眼神饱含泪水，无力地看着自己。\n\n大山向她笑了笑，竖起了大拇指。\n\n妻子轻微的尽力地问道，\"男孩女孩？\"\n\n\n\n\n"
        ],
        [
            "女孩",
            "4"
        ],
        [
            "男孩",
            "5"
        ]
    ],
    "3": [
        [
            "流产了，一名旷世奇才程序员宝宝，因为你的选择，却从来没见过人世间"
        ],
        [
            "故事结束, 从头开始",
            0
        ]
    ],
    "4": [
        [
            "女孩子就要美美哒，当什么程序员！！！嫁给程序员就好啦~"
        ],
        [
            "故事结束, 从头开始",
            0
        ]
    ],
    "5": [
        [
            "林大山看到自己媳妇生了个儿子，开心又失落，毕竟哪个父亲不想要个女儿呢？ 未来要给儿子买房买车娶媳妇，想想心里就难受\n\n\"辛苦了\"，仿佛也不知道说什么，但是这三个字，却饱含了所有情感\n\n妻子尽力的微笑点点头，\"健康吗？\"\n\n作为一个母亲，担心的就是宝宝的健康了吧..\n\n“嗯，很健康，你是咱家头号功臣啊，哈哈“，林大山笑着说。\n\n”对了，孩子的名字你想好了吗？“，妻子现在也有了一些精神，打趣地问道。\n\n”想好了，你叫俊，我叫山，俊山为峰，孩子就叫林峰吧？”，大山看着孩子说到\n\n"
        ],
        [
            "嗯，听你的",
            "7"
        ],
        [
            "不行，太难听了",
            "6"
        ]
    ],
    "6": [
        [
            "因为林峰不叫林峰，和天才程序员失之交臂。\n\n如蝴蝶效应，一个名字会影响人的一生，一个决定会影响人的一世。\n\n"
        ],
        [
            "故事结束，回到起点",
            "0"
        ]
    ],
    "7": [
        [
            "\n餐厅里，林峰吃完早饭，喝起了牛奶\n\n”吨吨吨吨吨“\n\n”慢点喝，今天最后一搏，加油啊，不管考好考坏，老爸都以你为荣”，林大山说到\n\n“哎呀您放心吧，我心里有谱，走了啊！”，说着林峰站起来拿起书包，朝门外走了出去。\n\n林大山和妻子看着他的背影，仿佛孩子已经准备好自己开始闯荡人生。\n\n今天是6月8日，全国高考第二天。\n\n下午，林大山坐在客厅看电视，门锁咔的一声打开，林峰回来了。\n\n“过来来，看看这个暑假去哪玩啊”，林大山闭口不提考试，是不想给他压力。\n\n“老爸，我想去清华看看，提前看看自己的学校”，林峰边喝水边说。\n\n“噗。。。”，林大山一口老血差点喷出来，这小子一点也不谦虚啊。\n\n“行，那回头准备准备，和你发小小周一起吧，没准他也报的清华”，林大山说到，顺便刺激刺激林峰，小周和林峰学习成绩不相上下，两人暗中一直在对比较劲。林大山也知道这个情况，小周他爸老周一直也憋着劲想让自己儿子考的比林峰好，但是并不是每次都如意。林大山这句话，显然是想让林峰低调谦虚一些，省的骄傲。\n\n“👌，没问题”，林峰自信的比了一个ok的手势。\n\n6月月底，高考成绩公布了。\n\n林峰打开电脑，在社交工具上和同班的同学聊得火热，大家都在等自己的成绩公布。\n\n“哎，没考好，最后一道大题都没做完“，\n\n”我何止最后一题没做，我考完试才想起来有一道题写错答案了“，\n\n”哎，要是之前多复习复习就好了“，\n\n“我也是，没好好复习，后悔了”\n\n林峰看他们在群里聊天，肺都笑炸了。这帮人，都现在了还瞎胡说，哪有高考前没怎么复习的道理。\n\n“成绩出来了，快看”，群里不知道谁说了一句，大家根本没注意是谁说的，马上在网页上刷了起来，白色的网页一直在加载中，显示器后面是几十万考生焦急的心，仿佛这网页加载的时间比一辈子还长。\n\n“网页加载失败，请稍后重试”，电脑显示屏上出现了错误提示\n\n“妈的，行不行，这网站太垃圾了”，\n\n“气死了，刷不出来啊”\n\n“刷出来了！！”\n\n群里议论纷纷，由于服务器压力过大，一时无法及时响应这么大的QPS（每秒请求数），一时宕机，但是慢慢就恢复了。\n\n“哎，不高啊，刚刚够一本线估计”，\n\n”我看我二本都悬啊“\n\n”你们别瞎说了，学霸就瞎谦虚，我准备回家种地了“\n\n群里又开始热闹的讨论起来了，但是没人说自己分数，都是心机Boy和心机Girl啊。\n\n”叮叮叮“，一个头像闪了起来"
        ],
        [
            "是晓雯",
            "8"
        ],
        [
            "是周凯",
            "9"
        ]
    ],
    "8": [
        [
            "\n林峰心里一震，但是还是冷静下来。\n\n曾经她俩一桌过，他对她没什么感觉，到时隔壁桌张强很喜欢她，总是让他帮忙传纸条。\n\n有的时候上课老师在过道来回走，等老师背对着自己的时候，张强就立刻把纸条攒成球，扔给林峰，然后林峰再把纸条给晓雯。\n\n但是晓雯一直对张强不感冒，从来都是不看就扔了。\n\n”以后他的纸条你自己留着吧，别给我了“，下课后，晓雯对林峰说。\n\n林峰不太好意思，毕竟和自己没关系，他也是帮同学的忙，如果不帮他，怕他们说自己不乐于助人，更怕他们怀疑自己喜欢晓雯。\n\n上学的时候，最流行的绯闻，就是谁喜欢了谁，林峰可不愿做主角，况且他也不喜欢她。\n\n”我家电脑坏了，听说你是电脑高手，等放学回我家帮忙看看吧~？“，晓雯对他说，好像已经忘了刚才传纸条的事儿了。\n\n\n\n"
        ]
    ]
}