{
    "0": [
        [
            "## 简介\n\n\"赶紧走，离开这里，还愣着干嘛\"\n\n王硕对林峰喊道。这是他得意弟子，从大学毕业后就一直跟着他在超算部门维护和开发高性能的计算引擎。这是一个保密项目，由信息部部长带头，国家领导人直接负责。\n\n\n"
        ],
        [
            "开始",
            "1"
        ]
    ],
    "1": [
        [
            "## 银河超级计算机\n\n机房里机械发出的嘈杂声音震耳欲聋\n\n银河超级计算机不知道因为什么原因，满负载运转。\n\n因为超算是上万GPU和CPU集成的机柜组成，偶尔能听到一些机柜因为高压导致的静电磁暴。\n\n\"林峰，赶快离开这里\"\n\n一个带着眼睛的秃头中年人对一个年轻人说道。\n\n本来今天是周末，很多人都放假回家了。他是银河超算的主管主任王硕，早上因为不知名原因，超算一直满负荷运转，但是并没有人提交什么任务，他也没查出来什么原因。\n\n他带着他的徒弟林峰在这里查了一天，也没查出什么问题。\n\n因为超算都是满负荷运转，如果贸然关闭电源，将对计算机产生不可逆转的破坏，损失不可估量。\n\n但是机房里嗡嗡作响，风扇空调磁暴声音此起彼伏，如果有人在这里，随时可能因为静电高压导致电击死亡。\n\n\"赶紧走，离开这里，还愣着干嘛\"\n\n王硕对林峰喊道。这是他得意弟子，从大学毕业后就一直跟着他在超算部门维护和开发高性能的计算引擎。这是一个保密项目，由信息部部长带头，国家领导人直接负责。\n\n"
        ],
        [
            "立刻离开",
            "1-1"
        ],
        [
            "继续追查问题",
            "1-2"
        ]
    ],
    "2": [
        [
            "## 回首往事\n\n当初他大一刚入学的时候，虽然C语言的成绩一般，但是在王硕教的\"数据结构\"课程中，表现很好。尤其是在课程实习中的作业，超过了同期同学一大截。\n\n不是因为林峰的技术有多厉害，毕竟大一的同学都刚接触编程，都是从基础开始，都是在命令行中编写黑漆漆的命令。\n\n而林峰在实习中，不仅完成了实习任务，还把黑漆漆的命令行改写成了漂亮的界面系统，如果有加分的话，估计得分比满分还高。\n\n王硕知道这个同学不一般，从那时候开始就开始关注他。\n\n果然不失所望，林峰不仅学习成绩靠前，也积极参加学生会、团委、社团等学校组织和活动，是一个素质得到全面发展的优秀学生。\n\n在得知林峰想要考研的情况下，王硕向他抛出了橄榄枝，甚至可以直接保研到自己名下。\n\n但是林峰没拒绝也没答应，每天仍然刻苦复习，王硕偶尔也会在他朋友圈点点赞，希望提醒他自己很希望能收他当硕士研究生。\n\n其实王硕也不是普通的老师和员工，他毕业于MIT(麻省理工学院)坐落于美国马塞州，是世界著名私立研究型大学。一直到博士毕业后，来到海港市做博士生导师，四年后来到了西北信息大学当副教授。主要负责计算机基础学科研究，并主导负责国家西北计算中心建设工作，并且学校给他了约定，只要项目能拿下来，立刻转为正教授。\n\n考研结束后，王硕关心的问林峰 \n\n\"考的怎么样？报的哪个学校啊？\"\n\n\"成绩出来就知道啦，现在说出来，万一打脸了多不好\"\n\n王硕脸色一惊，心想\"小东西还不告诉我\"\n\n考研结果公布的时候，王硕不紧不慢的端着保温杯，坐在电脑前登录学校的招生网站，看看谁考上了自己的研究室。\n\n\"噗...\"  一颗枸杞差点呛到嗓子眼，他竟然看到了林峰的名字\n\n\"原来这小子是想自己考到我这里，果然不一般啊\" 嘴角微微一笑，满足的靠在了椅子背上，拿起保温杯在杯口吹了吹。\n\n电脑里还有个名字自己很熟悉，唐俊。\n\n成绩优异，是学院里的学霸人物，经常凭借自己学霸属性骗学妹和讨好老师。学习能力没的说，智商很高，就是让人觉得很轻浮，不太适合做学术研究。\n\n\"铃铃铃...\" 王硕的手机响了起来。\n\n\"老王，研究生考试结果出来了，你看了没？\" 电话一端毫无感情地说道\n\n\"看了，咱们学院的有两个人在我的研究室考试结果达标\" 王硕一脸严肃的说\n\n\"嗯，我也看到了，有一个是你一直牵挂的林峰，还有一个是唐俊，你那边准备招几个研究生？\"\n\n\"马上就要接手计算中心的建设了，可能会比较忙，新人不想招太多，1个就差不多了，这俩人里选一个吧，我觉得....\"\n\n\"老王，唐俊是西北市副市长唐经国的孩子你不会不知道吧？如果你只招一个，他必须要招进来，如果他在咱们研究室，对咱们资金拨款和你之后教授转正的事儿有不可估量的好处啊\"\n\n\"什么？他是副市长的儿子？那...可能真的是这样，可是....\"\n\n\"别可是了，那个林峰我了解过，除了学习好、素质强，他父母也就是普通家庭，你招进来对你的帮助不大，你自己考虑考虑\"\n\n\"嘟嘟嘟嘟..\" 电话那头电话挂断了。\n\n王硕舔了舔嘴唇，叹了一口气。如果选择了唐俊，确实能为项目争取更多资金同时在自己的职称评定上都能有所帮助，但是却有愧于林峰，毕竟自己当初还拉他直接保送过来，并且他踏实能干，智商也不低，是一个未来不可估量的年轻人，而且他凭借自己的努力报考了自己工作室来证明自己，这种骨气不是随便一个人就有的。\n\n到底招哪个，王硕犯了难。\n\n\"咚咚咚...\" 王硕的办公室有人敲门\n\n\"进来\"\n\n\"王教授\" 一个年轻女老师说\n\n\"哦，刘老师啊，怎么了？有什么事吗？\" \n\n刘老师是信大的教务处副主任，虽然40多了，但是保养得很好。\n\n\"哦，那什么，咱们市副市长老唐想晚上请你吃顿饭，你这边没问题吧？\"\n\n王硕脸上一抽，肯定是为了他儿子的事儿而来啊，不过虽然是他儿子考研想到自己的研究室，按照正常流程走，也有很大的胜算，为什么还要亲自请自己吃饭呢？有点想不通。不过这个小刘老师不是善茬，和这个副市长好像是有点关系，不然也不能这么年轻就当上了副主任，而且还不怎么干活，只顾着享受学校的福利。王硕对她一脸鄙夷。不过副市长的邀请，自己也不好推脱，只好答应。\n\n\"好的，没问题\"\n\n\"那就晚上七点半，贵宾楼，具体房间我回头告诉您\" 小刘面带微笑的说，然后把门带上出去了，心里想 \"老王这次要发财了\"，一脸羡慕的表情。\n\n王硕心里七上八下，犹如打翻的蛋炒饭，一团乱。如果真的要招唐俊进来，该怎么对林峰交代啊。"
        ],
        [
            "原来如此",
            "3"
        ]
    ],
    "3": [
        [
            "## 原来如此\n\n晚上王硕来到贵宾楼楼下，门前停满了豪车，抬头望了望，果然气派，称得上这个名字，然后又心想: \"这副市长能这么有钱吗? \"\n\n走进门口后，服务员立刻微笑迎上\n\n\"先生有预定位置吗?\" 虽然王硕穿的土里土气，但是还算规整。这种有名的大酒楼藏龙卧虎，甚至很多大官富商，都是轻装便服，所以服务员也不敢以貌取人。\n\n\"这不是王副教授吗\" 旁边突然进来一个西装笔挺的中年人\n\n王硕有点诧异的问到，\"老刘？\" \n\n\"老王啊，好久不见啊，你还在学校教书呢嘛？\" ，老路面带一丝猥琐的问到\n\n这个老刘叫刘新，是王硕的大学同学，学习一般，但是家境不错，家里经营了一个地产公司，毕业后也就直接回家当上了副总经理，当然他爸是总经理。在学校，曾经的班花喜欢学习好的王硕，根本不理刘新，刘新心里一直心怀怨恨。今天他要存心讽刺王硕。不管是在哪，副职在没有正职在的情况下，也都叫正职的名称以示尊敬，比如副教授都叫教授。但是刘新今天特别说明\"王副教授\",明显的是在讽刺他不是正职教授。\n\n\"是啊，还在努力教书育人，和老刘你比不了，没有家产继承啊\"，王硕满脸无奈的说道，顺便讽刺一下刘新\n\n\"你...\" ，刘新脸色一暗 \n\n\"王教授，您来了\"，一个西装笔直的年轻小伙跑过来说道，伸出手握住王硕的手。\n\n\"我是唐市长的秘书小伟，市长已经在楼上了，他让我下来迎迎您\"，小伟满脸笑容的说道。\n\n\"呦，今天和副市长一起吃饭啊\"，刘新不屑地说。\n\n\"几年不见，你这身份地位涨了不少啊，我和唐副市长可熟了，要不我去陪陪你们啊\"，刘新满脸鄙夷地说。\n\n\"你好，我们唐市长今天约的是王教授，不邀请其他人，你可以改日再约\"，小伟面露难色，心里想\"副市长可不是想见就能见的，更别说吃饭了\"\n\n刘新一听，一脸尴尬，其实他和副市长没那么熟，甚至还有求于他，刚才这么说也只是让王硕觉得自己和市长很亲近而已。\n\n\"小伟，老刘和你开玩笑呢，我们走吧\" \n\n王硕挥一挥手，笑呵呵的对小伟说。心里也一阵暗爽 \"让你老刘装逼\""
        ],
        [
            "不仅是饭局",
            "4"
        ]
    ],
    "4": [
        [
            "## 不仅是饭局\n\n\"市长，这位是王教授\"，秘书小伟推开门\n\n\"王教授你好，我是唐经国\"\n\n\"唐市长你好\"\n\n唐经国上前主动握住了王硕的手，激动地上下摆动。\n\n\"我一直听闻王教授在计算机领域能力超群，您说第二，整个西北没人敢说第一啊\"\n\n\"市长过奖了，我只是一个教书育人的老师罢了\"\n\n\"王教授谦虚了，听说最近国家马上要在西北建设一个国家重点超算中心，我看这机会非您莫属啊\"\n\n王硕心里一痒，确实如此，学校已经接到通知，国家已经决定了建设超算中心，而且马上就要公开声明了。但是具体的人选和地点没有确定。西北信息大学作为西北第一大学，自然担当了此次超算计划的学院派主导，而作为西北信息大的计算机学教授，他首当其冲是本次项目的默认人选。\n\n\"这事儿还是得听国家的，我只是执行罢了\"\n\n\"唉..王教授谦虚了，其实这次项目市长已经交给我来办理了，这个项目的主要资金和政策支持，主要是由我们西北市支持，也就是说和政府申请的各种条件，只要我批准了，基本上国家默认就支持了，所以王教授以后不要跟我客气啊，哈哈哈\"\n\n\"好好好，谢谢唐市长的支持，我必将尽全力把计算中心搞起来，不辜负市长和国家的期望\"\n\n\"这就好，这就好啊，来喝一个\"\n\n唐经国和王硕举杯一饮而尽，仿佛项目已经尽在两人手中掌握。\n\n\"不过还有一事，要麻烦王教授了\"\n\n唐经国面色一转，客气的说到\n\n\"您尽管说，如果我能帮到您，一定竭尽全力\"\n\n王硕心里一颤，该来的还是要来，估计是他儿子考研的事情。\n\n\"我儿子，叫唐俊，也在西北信息大读书，也是仰望王教授的声望和能力，报考了您的研究室，小孩子血气方刚，想学习也是好事，王教授应该没问题吧？\"\n\n唐经国不紧不慢的娓娓道来，仿佛走后门都是一个正经事情，不用藏着掖着。\n\n\"这，实不相瞒，公子确实报考了我的工作室，而且成绩优秀，但是....\"\n\n\"唉，那不就正好嘛，你放心，我家唐俊一定不会让您失望的。而且到时候经费划拨，绝对亏不了你的\"\n\n唐经国老谋深算的说到，根本不给王硕喘息的机会。而且最后一句明显的暗示，这次项目经费很充分，作为主负责人，可能也能拿不少好处，而且有副市长撑腰，也没人敢吭一声。\n\n不过王硕本来想说但是还有一个更合适人选，但是碍于面子说不出口，心里尽是委屈和惭愧。不过也只能答应他。\n\n\"好，好\"，几滴汗水从额头留下来。\n\n本来他是一个两袖清风、只读圣贤书、教书育人的教授，压根也没想过要拿项目回扣。但是毕竟副市长已经发话了，自己说不也真的太不识趣了，不仅项目可能给别的学校给西北信息造成损失，自己的教授生涯估计也就到头了。满脸的无奈和悔恨，不知道回去怎么和林峰说。满脑子想到林峰自信的样子，望着窗外车水马龙，自己的心事，却无人可说。\n\n"
        ],
        [
            "挑选测试",
            "5"
        ]
    ],
    "5": [
        [
            "## 挑选测试\n\n王硕第二天来到办公室，这种事憋的他太难受，长期的学院生涯也让他养成了有一说一，不隐瞒不欺骗的性格。他决定找林峰过来说清楚。\n\n\"王老师，您找我？\",林峰敲门小声问道。\n\n\"啊，小枫啊，进来，进来坐\"，王硕指了指凳子。\n\n\"考研结果出来了，你成绩非常优秀，已经过了我的研究室招生线了\"\n\n\"哦，那谢谢王老师啦\"\n\n\"不过，还有一个人和你有竞争，是唐俊，你认识吧？\"\n\n\"唐俊?\" 林峰心里想，确实，他学习成绩也很好，就是人品有点差，干活不踏实，典型的聪明人。\n\n\"哦，那王老师您准备录取谁呢？\"，林峰有点犹豫的问道，毕竟他和唐俊比，确实能力不相上下。\n\n\"唐俊和你都是学校的好苗子，都很优秀。但是你比唐俊踏实能干一点。不过...\"\n\n王硕话到嘴边，但是说不出口，自己研究室的招生竟然被外人插手，而且自己还不能反抗，真是当导师的奇耻大辱。\n\n\"难道您选择了唐俊？这样也好，轮智商和情商，他确实在我之上\"，林峰有些伤心但是坚毅地说到。\n\n\"还没有定，我还在想怎么能用公平的方式，再进行一次测试，从你们两个人中选择一个更适合学术研究的人\"\n\n王硕临时想到一个方法，暂时回避了这尴尬的局面，至少能缓和一下现阶段的问题，腾出一些时间来想一下到底录用哪个。\n\n\"行，王老师，我相信您的任何决策\"，林峰满怀信心的说，及时他没有选择自己，自己也甘心认输，毫无怨言。\n\n\"你先回去等我消息吧，我和学院商量一下\"，王硕立刻给院长发了信息，准备开会探讨一下如何处理这个问题，毕竟他的决定不仅关乎学生的前途，还有学校的利益。"
        ],
        [
            "未完待续",
            "6"
        ]
    ],
    "1-1": [
        [
            "\n\n现在情况十分严重，但是由于机房磁暴，手机信号有强烈干扰。连电脑网络都十分不稳定。王硕要立刻出去向上面汇报具体情况，等待指示。如果操作不当，他自己一个人无法承担这么大的后果。\n\n\"好的，这就来了！\"\n\n林峰立刻拿起钥匙，往外冲了出去\n\n\"砰！！！\" 一声巨响，机房内出现一道闪电一样的静电磁暴，从超算的机柜连接到了林峰身上。\n\n\"啊！！！\" 林峰大喊了一声晕了过去。\n\n\"小枫！！\" 王硕喊到，同时扔了手中的手机，快速奔到了林峰身边。\n\n只见他面色发白，肌肉紧绷，心脏和呼吸都暂停了，出现了典型的假死状态，同时散发出阵阵烧焦的味道。\n\n与此同时，机房突然安静了，除了空调问问作响，连散热风扇的声音都已经隐约能听见而已。\n\n银河超算又恢复到和以前一样，安静而平稳的躺在那里，等待接受任务指令。\n\n\"都怪我啊！早拉着你出来就好了...\" 王硕眼含泪水，抱着小枫的身体，咬着牙颤抖着。\n\n门外脚步声躁动，保安和计算中心的同事们从门外跑了进来，很多是因为听到报警后，从家里立刻赶到现场的。\n\n\"他是用生命，捍卫了国家财产啊\"\n\n\"王主任你放心，我们一定为他申请烈士称号\"\n\n\"小枫真是舍身为国的好榜样啊\"\n\n\"马上叫救护车\"\n\n众人议论着，一些工作人员也不禁潸然落泪。\n\n王硕不由自主的抖动着身体，回忆起当初的情形。\n\n林峰是他在西北信息大学的硕士研究生。"
        ],
        [
            "回首往事",
            "2"
        ]
    ],
    "1-2": [
        [
            "\n现在情况十分严重，但是由于机房磁暴，手机信号有强烈干扰。连电脑网络都十分不稳定。王硕要立刻出去向上面汇报具体情况，等待指示。如果操作不当，他自己一个人无法承担这么大的后果。\n\n\"师父，再等一下，我马上就能确认问题了\"\n\n林峰手指快速的在键盘上挥舞着，屏幕上闪现着各种系统数据。\n\n\"我看到了！！\"林峰叫喊着，夹杂着激动和恐惧。\n\n\"砰！！！\" 一声巨响，机房内出现一道闪电一样的静电磁暴，从超算的机柜连接到了林峰身上。\n\n\"啊！！！\" 林峰大喊了一声晕了过去。\n\n\"小枫！！\" 王硕喊到，同时扔了手中的手机，快速奔到了林峰身边。\n\n只见他面色发白，肌肉紧绷，心脏和呼吸都暂停了，出现了典型的假死状态，同时散发出阵阵烧焦的味道。\n\n与此同时，机房突然安静了，除了空调问问作响，连散热风扇的声音都已经隐约能听见而已。\n\n银河超算又恢复到和以前一样，安静而平稳的躺在那里，等待接受任务指令。\n\n\"都怪我啊！早拉着你出来就好了...\" 王硕眼含泪水，抱着小枫的身体，咬着牙颤抖着。\n\n门外脚步声躁动，保安和计算中心的同事们从门外跑了进来，很多是因为听到报警后，从家里立刻赶到现场的。\n\n\"他是用生命，捍卫了国家财产啊\"\n\n\"王主任你放心，我们一定为他申请烈士称号\"\n\n\"小枫真是舍身为国的好榜样啊\"\n\n\"马上叫救护车\"\n\n众人议论着，一些工作人员也不禁潸然落泪。\n\n王硕不由自主的抖动着身体，回忆起当初的情形。\n\n林峰是他在西北信息大学的硕士研究生。"
        ],
        [
            "回首往事",
            "2"
        ]
    ]
}