const chapters = {
    0: [
        ['*林峰出生在一个工薪阶层的小康之家，随着信息技术的发展，没想到他将带领人类从生物到数据的升华*'],
        ['开始', 1]
    ],
    1: [["在产房里，外面的丈夫坐在椅子上，焦急的等待着。\n\n不是他不站起来，是因为担心与害怕席卷了全身，怕....\n\n在生产之前，他明确的说过：不管怎么样，都要保大人！！\n\n医生笑了笑，跟他说：“大哥，这都啥年代了，几乎没有生不出来的，实在有问题的话就剖腹产了，很安全”\n\n“好吧，不过万一真的有什么问题，一定要保大人”，林大山坚定的说\n\n“好的好的”，医生收回了笑容，因为这不是他不信任医生，而是更珍惜他的女人。"], ["出生", "2"], ["流产", "3"]],
    2: [["大山焦急的等待着，产房的红灯一直亮着。\n\n他大脑空白，仿佛没有了思想。\n\n在产房外踱步走来走去，心烦意乱，还是坐下比较放松一些。\n\n紧张的神经导致双腿就像爬过百望山一样，不自然的抽动着。\n\n”哇！哇！“，妇产室里传来婴儿的哭啼声\n\n”生了？！？“，虽然屋外每人，林大山不自主的大喊了起来，仿佛要告诉世界，我当爸爸了。\n\n“家属进来，母子平安昂”，一名小护士推开门对大山平静而不经心地说道，可能对于护士，生产已经司空见惯。但是对于一个家庭来说，这是头等大事。\n\n“好好”，林大山踉跄着快步跑了进去。\n\n看到婴儿裹着毯子抱在一个护士怀里，护士看到林大山后，把婴儿推给了他。但是大山没有接过来，径直走向手术床前，看到了自己虚弱的妻子。\n\n”怎么样？累不累？”大山温柔的问道\n\n”嗯...“，妻子虚弱的回复，点了点头，脸上漏出了一点点的笑容\n\n”我去看看孩子“，大山用嘴唇轻轻亲吻了她的面颊后说\n\n”男孩女孩？“ 大山问到。\n\n”自己看“ 护士笑呵呵的对他说。\n\n林大山接过婴儿，心想：”怎么这么难看？“\n\n掀开襁褓，分开小腿一看，他立刻抬起头，看到虚弱的妻子躺在床上，游离的眼神饱含泪水，无力地看着自己。\n\n大山向她笑了笑，竖起了大拇指。\n\n妻子轻微的尽力地问道，\"男孩女孩？\"\n\n\n\n\n"], ["女孩", "4"], ["男孩", "5"]],
    3: [
        ['流产了，一名旷世奇才程序员宝宝，因为你的选择，却从来没见过人世间'],
        ['故事结束, 从头开始', 0]
    ],
    4: [
        ['女孩子就要美美哒，当什么程序员！！！嫁给程序员就好啦~'],
        ['故事结束, 从头开始', 0
        ]
    ],
    5: [["林大山看到自己媳妇生了个儿子，开心又失落，毕竟哪个父亲不想要个女儿呢？ 未来要给儿子买房买车娶媳妇，想想心里就难受\n\n\"辛苦了\"，仿佛也不知道说什么，但是这三个字，却饱含了所有情感\n\n妻子尽力的微笑点点头，\"健康吗？\"\n\n作为一个母亲，担心的就是宝宝的健康了吧..\n\n"], ["健康", "7"], ["不健康", "6"]],
    6: [["\n大山满怀父爱地看了一眼怀中的婴儿，看到了婴儿的小拇指\n\n脸色一沉，对妻子说道：“好像不太健康”\n\n“啊？”，妻子完全不敢相信自己的耳朵，想要起身，却虚弱无力\n\n“哈哈，别激动，就是小脚趾和你一样，是两半的”，大山笑道。\n\n“傻逼！你想吓死我啊“，妻子一听，生气的笑着骂道，小拇指是两半的，随我呀，智商一定比他爸高。这是山西祖籍血缘的象征，当年自己的祖先从山西大槐树走出来，一直到现在，小拇指两半的基因，就是从那里传出来的。"]],
7: [["\n大山满怀父爱地看了一眼怀中的婴儿，看到了婴儿的小拇指\n\n脸色一喜，对妻子说道：“很健康~不过小拇指是随了我啦，哈哈”\n\n妻子一听，满意的点了点头。自己的小拇指是两半的，虽然和血缘有关系，但是多少是个缺陷。看来是随他爸了，是个完美的小宝宝。\n"]],
//--CHAPTER_ADD_HERE--DO_NOT_MODIFY_THIS_LINE--//
};